/********************************************************************
* 文件名  ： 动态显示.c
* 描述    :  8位数码管低两位分别显示   1，2

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

uchar code table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
uchar code LED_W[8] = {0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay(uint i)
{
	uchar x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}

/********************************************************************
* 名称 : Main()
* 功能 : 数码管的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	while(1)
	{
		P0 = 0;		 		 //消隐
		P2 = 6;		 		 //点亮第二位数码管（从右往左数）
		P0 = table[1];		 // i 值的 个位数
		Delay(3);
		P0 = 0;		 		 //消隐
		P2 = 7;		 		 //点亮第一位数码管
		P0 = table[2];		 // i 值的 个位数
		Delay(3);
	}
}
