/********************************************************************
* 文件名  :  数码管显示.c
* 描述    :  该程序为单位数码管静态显示程序。
			 程序实现了单个数码管的显示。每隔0.5秒依次显示：0,1,2,3,4,5,6,7,8,9,a,b,c,d,e,f.			 

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

//数码管的段码编码
uchar table[16] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};

/********************************************************************
* 名称 : Delay()
* 功能 : 延时,延时时间为 10ms * del
* 输入 : del
* 输出 : 无
***********************************************************************/
void Delay(uint del)
{
	uint i,j;
	for(i=0; i<del; i++)
	for(j=0; j<1827; j++)    
	;
}

/********************************************************************
* 名称 : Main()
* 功能 : 主函数
* 输入 : 无
* 输出 : 无
***********************************************************************/
void main()
{
	uchar i = 0;
	P2 = 7;							    //最后一位数码管被点亮
	while(1)
	{
		P0 = table[i % 16];	  //在这里取 i 的个位数，不带点显示
		i++;
		Delay(50); 			      //延时0.5秒后显示下一个数		                
	}
}
