/********************************************************************
* 文件名  ： 动态显示.c
* 描述    :  在数码管上的每位每个0.3秒，显示7,6,5,4,3,2,1，0.
             如果按下S19不放(独立按键左边的那个），这时，数码管段选被锁存，
			 这个时候，虽然代码在改变段选的值，但是，我们看到数码管上的值是不变的。

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

uchar code table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
uchar code LED_W[8] = {0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};

sbit KEY1 = P3^2;
sbit LOCKDuan = P3^7;
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay(uint i)
{
	uint x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}

/********************************************************************
* 名称 : Main()
* 功能 : 数码管的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	uchar i;
	while(1)
	{		
		for(i=0;i<8;i++)
		{
			//每位数码管依次闪烁			
			P2 = i;		        //选择哪一位数码管点亮
			P0 = table[i];		//赋值段码给P0口
			Delay(300);			  //延时0.3秒
			if(KEY1 == 0)		  //按下S19，这时数码管段选锁存
			{
				LOCKDuan = 0;	  //给74HC573段选芯片锁存端口赋值低电平
			}
			else
			{
				LOCKDuan = 1;
			}
		}
	}
}
