/********************************************************************
* 文件名  ： 数码管滚动显示.c
* 描述    :  八个数码管显示0--7，每个0.64秒钟，数据从左往右移动一位

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

uchar code table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
uint LED_temp = 0;
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay(uint i)
{
	uchar x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}

/********************************************************************
* 名称 : Main()
* 功能 : 数码管的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	uchar i,j;
	while(1)
	{											   
		for(j=0;j<40;j++) 							//j自加一次，在内层循环已经走了16毫秒
		{
			for(i=0;i<8;i++)
			{
				P0 = 0;								//消隐
				P2 = i;		                		//点亮某一位数码管
				P0 = table[(i + LED_temp) % 8];	    //数码管段值
				Delay(2);							//延时0.02秒
			}
		}
		LED_temp +=1;								//LED_temp 自加1
	}
}
