/********************************************************************
* 文件名  ： 数码管字符显示.c
* 描述    :  这个代码可以实现数码管的字符显示。
			 这个是数码管的一个扩展实验，可以让数码管显示一些简单的字符。
			 这里实验中，我们在数码管的右边5位，现实了“HELLO

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

//uchar code table[8] = {0x00,0x00,0x00,0x00,0x73,0x77,0x6d,0x6d};	 //显示PASS编码
uchar code table[8] = {0x00,0x00,0x00,0x76,0x79,0x38,0x38,0x3f};	 //显示HELL0编码
uchar code LED_W[8] = {0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay(uint i)
{
	uchar x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}

/********************************************************************
* 名称 : Main()
* 功能 : 数码管的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	uchar i;
	while(1)
	{
		for(i=0;i<8;i++)
		{
		    P0 = 0;				  //消隐
			P2 = i;		        //点亮某一位数码管
			P0 = table[i];    //数码管段值
			Delay(2);
		}
	}
}
