/********************************************************************
* 文件名  ： 独立按键.c
* 描述    :  该程序实现独立按键的判断，按了相应的独立按键后，在LED上进行表现。
	
***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

sbit KEY1 = P3^2;    
sbit KEY2 = P3^3;
sbit KEY3 = P3^4;

sbit LED1 = P0^0;
sbit LED2 = P0^1;
sbit LED3 = P0^2; 
/********************************************************************
* 名称 : Delay()
* 功能 : 延时,延时时间为 10ms * del
* 输入 : del
* 输出 : 无
***********************************************************************/
void Delay(uint del)
{
	uint i,j;
	for(i=0; i<del; i++)
	for(j=0; j<1827; j++)   
	;
}

/********************************************************************
* 名称 : Delay()
* 功能 : 实现按键功能，并在LED上显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void KEY()
{
	if(KEY1==0 || KEY2==0 || KEY3==0)	
	{
		Delay(2);   		//20毫秒软件防抖
		if(KEY1 == 0)
		{ 
			LED1 = 0;
			LED2 = 1;
			LED3 = 1;
		}
		if(KEY2 == 0)
		{			
			LED1 = 1;
			LED2 = 0;
			LED3 = 1;
		}
		if(KEY3 == 0)
		{			
			LED1 = 1;
			LED2 = 1;
			LED3 = 0; 
		}
		Delay(50);			//延时0.5秒再进行下次按键的检测
	}	
}
/********************************************************************
* 名称 : Main()
* 功能 : 实现按键控制LED的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	while(1)
	{
		 KEY();
	}
}
