/********************************************************************
* 文件名  ： 数码管字符显示.c
* 描述    :  按下按键，数码管上显示的数字加1。

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int
sbit KEY = P3^2;
uchar table[16] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};
/********************************************************************
* 名称 : Delay()
* 功能 : 延时,延时时间为 10ms * del
* 输入 : del
* 输出 : 无
***********************************************************************/
void Delay(uint del)
{
	uint i,j;
	for(i=0; i<del; i++)
	for(j=0; j<1827; j++)    
	;
}
/********************************************************************
* 名称 : Main()
* 功能 : 数码管的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	uchar i = 0;
	P2 = 7;
	while(1)
	{
		P0 = table[i%16];		   //这里i%16是防止table中的数据在0--15，不会溢出
		if(KEY == 0)
		{
			i++;
			Delay(30);			   //延时0.3秒，防止按一次按键，程序自加多次的情况
		}
	}
}
