/********************************************************************
* 文件名  ： 独立按键.c
* 描述    :  这个代码相对于初学者比较麻烦一些。
			 在数码管上显示全是0.
			 当按下S18，这个时候是选择某一位数码管，数码管会稍微亮一些。
			 当按下S19或S17, 这时被选择的那位数码管可以进行加减控制。

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

sbit KEY1 = P3^2;    
sbit KEY2 = P3^3;
sbit KEY3 = P3^4;

//数码管的段码编码
uchar table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};

uchar SLED[8]={0};
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay_1ms(uint i)
{
	uint x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}

/********************************************************************
* 名称 : Delay()
* 功能 : 延时,延时时间为 16ms * del	，
		 在延时函数中加入了数码管的操作，
         这样按下按键后延时，数码管不会闪烁。
* 输入 : del
* 输出 : 无
***********************************************************************/
void Delay(uchar temp)
{
	uchar i,j;
	for(j=0;j<temp;j++)
	{
		for(i=0;i<8;i++)
		{
			P0 = 0;
			P2 = i;
			P0 = table[SLED[i]]; 
			Delay_1ms(2);
		}
	}
}

/********************************************************************
* 名称 : Delay()
* 功能 : 实现按键功能，并在LED上显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
uchar KEY(void)
{
	if(KEY1==0 || KEY2==0 || KEY3==0)	
	{
		Delay(2);   		//20毫秒软件防抖
		if(KEY1 == 0)
		{ 
			Delay(10);
			return 1;
		}
		if(KEY2 == 0)
		{			
			Delay(10);
			return 2;
		}
		if(KEY3 == 0)
		{			
			Delay(10);
			return 3; 
		}
		Delay(10);
		return 0;
	}
	return 0;	
}
/********************************************************************
* 名称 : Main()
* 功能 : 实现按键控制LED的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	uchar temp,i=0,j=0,cs=0;
	while(1)
	{
		temp = KEY();
		if(temp == 1)
		{
			if(SLED[cs] != 0)
			{
				SLED[cs] = SLED[cs] - 1;		//被选数码管的值减1
			}
		}
		if(temp == 2)	
		{
			if(cs != 7)
			{
				cs++;		 					//被选数码管右移一位
			}
			else
			{
				cs = 0;
			}			
		}
		if(temp == 3)
		{
			if(SLED[cs] != 9)
			{
				SLED[cs] = SLED[cs] + 1;	  	//被选数码管的值加1
			}
		}
		for(i=0;i<8;i++)
		{
	    	if(i != cs)
			{
				P0 = 0;
				P2 = i; 
				P0 = table[SLED[i]];
				Delay_1ms(1);
			}									 
			else								 //如果是被选择的那个数码管，进入下面控制
			{
				P0 = 0;
				P2 = i; 
				P0 = table[SLED[i]];
				Delay_1ms(10);					 //延时时间长一点，这时，数码管更亮
			}
		}	
	}
}
