/********************************************************************
* 文件名  ： 独立按键.c
* 描述    :  该程序实现独立按键的判断，按了相应的独立按键后，
             会在数码管上显示最先被按下的值，只有按复位按键或者重新开电才消失。

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int

sbit KEY1 = P3^2;    
sbit KEY2 = P3^3;
sbit KEY3 = P3^4;

//数码管的段码编码
uchar table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f}; 

/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay_1ms(uint i)
{
	uint x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}


/********************************************************************
* 名称 : Delay()
* 功能 : 实现按键功能，并在LED上显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
uchar KEY(void)
{
	if(KEY1==0 || KEY2==0 || KEY3==0)	
	{
		Delay_1ms(20);   		//20毫秒软件防抖
		if(KEY1 == 0)
		{ 
			Delay_1ms(200);
			return 1;
		}
		if(KEY2 == 0)
		{			
			Delay_1ms(200);
			return 2;
		}
		if(KEY3 == 0)
		{			
			Delay_1ms(200);
			return 3; 
		}
		Delay_1ms(200);
	}
	return 0;	
}
/********************************************************************
* 名称 : Main()
* 功能 : 实现按键控制LED的显示
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	uchar temp,i=0,j=0,cs=0;
	while(1)
	{
		temp = KEY();					 //判断是否有按键按下
		if(temp != 0)
		{
			break;						 //如果按下，那么退出循环
		}
	}
	P0 = table[temp];				     //显示是哪个按键按下了
	P2 = 7; 
	while(1);							 //程序停止
}
