/********************************************************************
* 描述    :  计数器0的使用。
			 当计数器0端口P3.4有信号输入的时候，计时器0就会捕捉到相应的信号。
			 这个是计时器0的外部触发端口。
			 当按下S17的时候，数码管上的值会加1.			 

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int 

uint Count = 0;
uchar i = 0;
uchar code table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay(uint i)
{
	uint x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}
/********************************************************************
* 名称 : Time0_Init()
* 功能 : 定时器的初始化，11.0592MZ晶振
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Time0_Init()
{
	TMOD = 0x06;	
	TH0  = 0xff;
	TL0  = 0xff;
	IE 	 = 0x82;	
	TR0 = 1;		
}
										 
/********************************************************************
* 名称 : Time0_Int()
* 功能 : 定时器中断，中断中实现 Count 加一
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Time0_Int() interrupt 1
{
	TR0 = 0;
	i++;
	TH0  = 0xff;
	TL0  = 0xff;
			//长度加1
	Delay(200);
	TR0 = 1;
}

/********************************************************************
* 名称 : Main()
* 功能 : 主函数
* 输入 : 无
* 输出 : 无
***********************************************************************/
void main()
{
	Time0_Init();
	P2 = 7;
	while(1)
	{
		P0 = table[i % 10];	  //取 i 的个位
	}
}
