/********************************************************************
* 描述    :  这个代码中，我们用用计数器0来作为一个信号捕捉的端口。
             当在P3.4端口采集到下降沿的时候，会在数码管上加1.
			 （P1.0连接到P3.4)在程序代码中，我们给了P1.0端口，进行 一个赋值，让它电平交替变化。
			 每变化一次，数码管的值就会加1。

***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int 

unsigned long i = 0;
sbit OUT = P1^0;               //P1.0端口作为计时器0的信号产生器
uchar table[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
uchar code LED_W[8] = {0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void Delay(uint i)
{
	uint x,j;
	for(j=0;j<i;j++)
	for(x=0;x<=148;x++);	
}
/********************************************************************
* 名称 : Time0_Init()
* 功能 : 定时器的初始化，11.0592MZ晶振，8ms
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Time0_Init()
{
	TMOD = 0x06;	
	TH0  = 0xff;
	TL0  = 0xff;
	IE 	 = 0x82;	
	TR0 = 1;		
}
										 
/********************************************************************
* 名称 : Time0_Int()
* 功能 : 定时器中断，中断中实现 Count 加一
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Time0_Int() interrupt 1
{
	i++;
}

/********************************************************************
* 名称 : Main()
* 功能 : 主函数
* 输入 : 无
* 输出 : 无
***********************************************************************/
void main()
{
	unsigned long j;
	unsigned long tabPL[8]={0};
	Time0_Init();
	while(1)
	{
		tabPL[0] = i % 10;
		tabPL[1] = (i /10)%10;
		tabPL[2] = (i /100)%10;
		tabPL[3] = (i /1000)%10;
		tabPL[4] = (i /10000)%10;
		tabPL[5] = (i /100000)%10;
		tabPL[6] = (i /1000000)%10;
		tabPL[7] = (i /10000000)%10;
		for(j=0;j<8;j++)
		{
			P0 = table[tabPL[j]];	  //取 i 的个位
			P2 = 7-j;
			Delay(1);
		}
		Delay(2);
		OUT = ~OUT;					//每隔10毫秒，P1.0的电平会改变。
	}
}
